## Terraform Plan

**Image:** `239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:a41d85c`

<details>
<summary>Show Plan</summary>

```
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
aws_ecr_repository.agent: Refreshing state... [id=iker-agents/dsp-agent]
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
aws_ecr_lifecycle_policy.agent: Refreshing state... [id=iker-agents/dsp-agent]
module.dsp_agent.data.aws_iam_policy_document.bedrock_invoke: Reading...
module.dsp_agent.data.aws_iam_policy_document.xray: Reading...
module.dsp_agent.aws_bedrockagentcore_memory.this: Refreshing state... [id=dsp_agent_tf_memory-lRHahyCGis]
module.dsp_agent.data.aws_iam_policy_document.runtime_assume_role: Reading...
module.dsp_agent.data.aws_caller_identity.current: Reading...
module.dsp_agent.data.aws_region.current: Reading...
module.dsp_agent.data.aws_iam_policy_document.cloudwatch_logs: Reading...
module.dsp_agent.data.aws_iam_policy_document.bedrock_invoke: Read complete after 0s [id=1713947774]
module.dsp_agent.data.aws_iam_policy_document.ecr_pull: Reading...
module.dsp_agent.data.aws_iam_policy_document.ecr_pull: Read complete after 0s [id=3988369881]
module.dsp_agent.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.dsp_agent.data.aws_iam_policy_document.cloudwatch_logs: Read complete after 0s [id=3253318109]
module.dsp_agent.data.aws_iam_policy_document.runtime_assume_role: Read complete after 0s [id=4217861921]
module.dsp_agent.data.aws_iam_policy_document.xray: Read complete after 0s [id=1756567564]
module.dsp_agent.aws_iam_role.runtime: Refreshing state... [id=dsp-agent-tf-runtime-role]
module.dsp_agent.data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
module.dsp_agent.data.aws_iam_policy_document.memory_access: Reading...
module.dsp_agent.data.aws_iam_policy_document.memory_access: Read complete after 0s [id=479195913]
module.dsp_agent.aws_iam_role_policy.ecr_pull: Refreshing state... [id=dsp-agent-tf-runtime-role:ecr-pull]
module.dsp_agent.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=dsp-agent-tf-runtime-role:cloudwatch-logs]
module.dsp_agent.aws_iam_role_policy.xray: Refreshing state... [id=dsp-agent-tf-runtime-role:xray-tracing]
module.dsp_agent.aws_iam_role_policy.bedrock_invoke: Refreshing state... [id=dsp-agent-tf-runtime-role:bedrock-invoke]
module.dsp_agent.aws_iam_role_policy.memory_access: Refreshing state... [id=dsp-agent-tf-runtime-role:memory-access]
module.dsp_agent.aws_bedrockagentcore_agent_runtime.this: Refreshing state...
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["dev"]: Refreshing state... [name=dev]
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["prod"]: Refreshing state... [name=prod]
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["canary"]: Refreshing state... [name=canary]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.dsp_agent.aws_bedrockagentcore_agent_runtime.this will be updated in-place
  ~ resource "aws_bedrockagentcore_agent_runtime" "this" {
      ~ agent_runtime_version     = "6" -> (known after apply)
        tags                      = {
            "Agent"     = "dsp-agent-tf"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (10 unchanged attributes hidden)

      ~ agent_runtime_artifact {
          ~ container_configuration {
              ~ container_uri = "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:ca3d59c" -> "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:a41d85c"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.ui[0].data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/ui/lambda.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                import json
                import boto3
                import os
                import uuid
                from typing import Any
                
                client = boto3.client('bedrock-agentcore')
                
                # Runtime ARNs from environment
                RUNTIME_ARNS = json.loads(os.environ.get('RUNTIME_ARNS', '{}'))
                
                def handler(event: dict[str, Any], context: Any) -> dict[str, Any]:
                    """Proxy requests to Bedrock AgentCore runtimes."""
                
                    # CORS headers
                    headers = {
                        'Access-Control-Allow-Origin': '*',
                        'Access-Control-Allow-Headers': 'Content-Type,Authorization',
                        'Access-Control-Allow-Methods': 'GET,POST,OPTIONS',
                        'Content-Type': 'application/json'
                    }
                
                    # Handle preflight
                    if event.get('httpMethod') == 'OPTIONS':
                        return {
                            'statusCode': 200,
                            'headers': headers,
                            'body': ''
                        }
                
                    try:
                        path = event.get('path', '')
                        method = event.get('httpMethod', 'GET')
                        body = json.loads(event.get('body', '{}')) if event.get('body') else {}
                
                        # GET /agents - List available agents
                        if path == '/agents' and method == 'GET':
                            agents = []
                            for name, arn in RUNTIME_ARNS.items():
                                agents.append({
                                    'id': name.lower().replace(' ', '-'),
                                    'name': name,
                                    'runtime_arn': arn,
                                    'status': 'active'
                                })
                
                            return {
                                'statusCode': 200,
                                'headers': headers,
                                'body': json.dumps({'agents': agents})
                            }
                
                        # POST /invoke - Invoke an agent
                        if path == '/invoke' and method == 'POST':
                            agent_id = body.get('agent_id')
                            input_text = body.get('input', '')
                            # Generate session ID with minimum 33 chars (uuid.hex = 32 chars)
                            session_id = body.get('session_id') or f"s-{uuid.uuid4().hex}"
                            user_id = body.get('user_id', 'default-user')
                
                            if not agent_id or agent_id not in RUNTIME_ARNS:
                                return {
                                    'statusCode': 400,
                                    'headers': headers,
                                    'body': json.dumps({
                                        'error': f'Invalid agent_id: {agent_id}',
                                        'available': list(RUNTIME_ARNS.keys())
                                    })
                                }
                
                            runtime_arn = RUNTIME_ARNS[agent_id]
                
                            # Build payload for AgentCore
                            payload = {
                                'input': input_text,
                                'user_id': user_id,
                                'session_id': session_id,
                                'stream': False
                            }
                
                            # Invoke AgentCore runtime
                            invoke_params = {
                                'agentRuntimeArn': runtime_arn,
                                'runtimeSessionId': session_id,
                                'payload': json.dumps(payload)
                            }
                
                            response = client.invoke_agent_runtime(**invoke_params)
                
                            # Parse non-streaming response
                            response_body = response['response'].read()
                            response_data = json.loads(response_body)
                
                            # Log full response for debugging
                            print(f"AgentCore response: {json.dumps(response_data)}")
                
                            # Extract output from response (structure may vary)
                            output = response_data.get('output', '')
                            if not output and 'text' in response_data:
                                output = response_data['text']
                            if not output and 'content' in response_data:
                                output = response_data['content']
                            if not output:
                                # If still no output, return the whole response for debugging
                                output = json.dumps(response_data)
                
                            result = {
                                'output': output,
                                'session_id': session_id,
                            }
                
                            return {
                                'statusCode': 200,
                                'headers': headers,
                                'body': json.dumps(result)
                            }
                
                        # Default 404
                        return {
                            'statusCode': 404,
                            'headers': headers,
                            'body': json.dumps({'error': 'Not found'})
                        }
                
                    except Exception as e:
                        import traceback
                        error_details = traceback.format_exc()
                        print(f"Error: {error_details}")
                        return {
                            'statusCode': 500,
                            'headers': headers,
                            'body': json.dumps({'error': str(e), 'details': error_details})
                        }
            EOT
          + filename = "index.py"
        }
    }

  # module.ui[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.ui[0].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.ui[0].aws_apigatewayv2_api.api will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "agent-ui-tf-api"
      + protocol_type                = "HTTP"
      + region                       = "us-east-1"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all                     = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }

      + cors_configuration {
          + allow_headers = [
              + "Authorization",
              + "Content-Type",
            ]
          + allow_methods = [
              + "GET",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.ui[0].aws_apigatewayv2_integration.lambda will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "us-east-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.ui[0].aws_apigatewayv2_route.agents will be created
  + resource "aws_apigatewayv2_route" "agents" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + route_key          = "GET /agents"
      + target             = (known after apply)
    }

  # module.ui[0].aws_apigatewayv2_route.invoke will be created
  + resource "aws_apigatewayv2_route" "invoke" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + route_key          = "POST /invoke"
      + target             = (known after apply)
    }

  # module.ui[0].aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + region        = "us-east-1"
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
    }

  # module.ui[0].aws_cloudfront_distribution.ui will be created
  + resource "aws_cloudfront_distribution" "ui" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all                        = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "S3-Website"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_id                   = "S3-Website"
          + response_completion_timeout = (known after apply)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.ui[0].aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "agent-ui-tf-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all              = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + unique_id             = (known after apply)
    }

  # module.ui[0].aws_iam_role_policy.lambda_agentcore will be created
  + resource "aws_iam_role_policy" "lambda_agentcore" {
      + id          = (known after apply)
      + name        = "agentcore-invoke"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "bedrock-agentcore:InvokeAgentRuntime"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ui[0].aws_iam_role_policy.lambda_logs will be created
  + resource "aws_iam_role_policy" "lambda_logs" {
      + id          = (known after apply)
      + name        = "lambda-logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ui[0].aws_lambda_function.proxy will be created
  + resource "aws_lambda_function" "proxy" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/ui/lambda.zip"
      + function_name                  = "agent-ui-tf-proxy"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all                       = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "RUNTIME_ARNS" = jsonencode(
                    {
                      + "DSP Agent" = "arn:aws:bedrock-agentcore:us-east-1:239388734812:runtime/dsp_agent_tf-NBo13y3YHj"
                    }
                )
            }
        }
    }

  # module.ui[0].aws_lambda_permission.api will be created
  + resource "aws_lambda_permission" "api" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "agent-ui-tf-proxy"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.ui[0].aws_s3_bucket.ui will be created
  + resource "aws_s3_bucket" "ui" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all                    = {
          + "Component" = "ui"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.ui[0].aws_s3_bucket_policy.ui will be created
  + resource "aws_s3_bucket_policy" "ui" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.ui[0].aws_s3_bucket_public_access_block.ui will be created
  + resource "aws_s3_bucket_public_access_block" "ui" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + region                  = "us-east-1"
      + restrict_public_buckets = false
    }

  # module.ui[0].aws_s3_bucket_website_configuration.ui will be created
  + resource "aws_s3_bucket_website_configuration" "ui" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + region           = "us-east-1"
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 15 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + ui_api_url                    = (known after apply)
  + ui_bucket_name                = (known after apply)
  + ui_cloudfront_distribution_id = (known after apply)
  + ui_url                        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @iker592, Action: `pull_request`*